type Download = {
  id: number;
  slug: string;
  name: string;
  thumbnail: string;
  summary: string;
  details: string;
};

export const Download: Download[] = [
  {
    id: 1,
    slug: 'download1',
    name: 'フランチャイズの開業に必要な書類リスト',
    thumbnail: 'thumbnail_example.webp',
    summary:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
    details:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
  },
  {
    id: 2,
    slug: 'download3',
    name: '実践！モダンJavaScript/TypeScript開発ガイド',
    thumbnail: 'thumbnail_example.webp',
    summary:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
    details:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
  },
  {
    id: 3,
    slug: 'download4',
    name: '実践！モダンJavaScript/TypeScript開発ガイド',
    thumbnail: 'thumbnail_example.webp',
    summary:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
    details:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
  },
  {
    id: 4,
    slug: 'download2',
    name: '実践！モダンJavaScript/TypeScript開発ガイド',
    thumbnail: 'thumbnail_example.webp',
    summary:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
    details:
      'プログラミングに初めて触れる方へ向けた、ビジュアル重視の解説資料です。「コードを書く＝魔法を唱える」をコンセプトに、簡単なゲームを作りながら基本の「き」を楽しく学べます。お子様と一緒に進めたい保護者の方にも最適です。',
  },
];
